astral-sh.ty
biomejs.biome
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
christian-kohler.path-intellisense
csstools.postcss
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
editorconfig.editorconfig
esbenp.prettier-vscode
golang.go
jnoortheen.nix-ide
kdl-org.kdl
mads-hartmann.bash-ide-vscode
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-vscode.vscode-typescript-next
myriad-dreamin.tinymist
nefrob.vscode-just-syntax
oderwat.indent-rainbow
oven.bun-vscode
redhat.ansible
redhat.vscode-xml
redhat.vscode-yaml
sumneko.lua
svelte.svelte-vscode
tamasfe.even-better-toml
timonwong.shellcheck
tomoki1207.pdf
usernamehw.errorlens
yoavbls.pretty-ts-errors
